server/tests/load/quick-test.yml
# server/tests/load/quick-test.yml
# 빠른 테스트 - 개발 중 간단 확인용 (30초)

config:
  target: 'http://localhost:3000'
  phases:
    - duration: 10
      arrivalRate: 5
      name: 'Quick check'
    - duration: 20
      arrivalRate: 10
      name: 'Load check'
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: 'Basic API Check'
    flow:
      - get:
          url: '/'
      - get:
          url: '/api/v1/units?page=1&limit=10'